<h2 style='color:purple' align='center'>Naive Bayes Part 1: Predicting survival from titanic crash</h2>

In [18]:
import pandas as pd

In [19]:
df=pd.read_csv("titanic.csv")
# this dataset is downloaded from Kaggle

In [20]:
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [21]:
inputs=df[['Pclass','Sex','Age','Fare']]

In [22]:
target=df['Survived']

The column "Sex" is a string...so use dummies

In [23]:
inputs.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [24]:
dumps=pd.get_dummies(inputs.Sex)

In [25]:
dumps.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [26]:
dumps=dumps.drop(columns='female')

In [27]:
dumps.head()

   male
0     1
1     0
2     0
3     0
4     1

In [28]:
X=pd.concat([inputs,dumps],axis=1)

In [29]:
X.head()

   Pclass     Sex   Age     Fare  male
0       3    male  22.0   7.2500     1
1       1  female  38.0  71.2833     0
2       3  female  26.0   7.9250     0
3       1  female  35.0  53.1000     0
4       3    male  35.0   8.0500     1

In [30]:
X=X.drop(columns='Sex')
X.head()

   Pclass   Age     Fare  male
0       3  22.0   7.2500     1
1       1  38.0  71.2833     0
2       3  26.0   7.9250     0
3       1  35.0  53.1000     0
4       3  35.0   8.0500     1

To check if there are any Nan values

In [31]:
X.isna().any()

Pclass    False
Age        True
Fare      False
male      False
dtype: bool

It shows that the Age column has NaN values

In [32]:
X.Age=X.Age.fillna(X.Age.mean())

In [33]:
X.isna().any()

Pclass    False
Age       False
Fare      False
male      False
dtype: bool

In [34]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X,target,test_size=0.2)

In [35]:
from sklearn.naive_bayes import GaussianNB
nb=GaussianNB()

In [36]:
nb.fit(X_train, y_train)

GaussianNB(priors=None, var_smoothing=1e-09)

In [37]:
nb.score(X_test,y_test)

0.7318435754189944

In [38]:
y_pred=nb.predict(X_test[:10])

In [39]:
y_pred

array([0, 1, 0, 0, 1, 0, 0, 1, 0, 0], dtype=int64)

In [40]:
y_test[:10]

465    0
554    1
433    0
75     0
140    0
117    0
841    0
132    0
91     0
614    0
Name: Survived, dtype: int64

In [41]:
Comparison= pd.DataFrame({
    'Actual' : y_test[:10],
    'Predicted' : y_pred
})

In [42]:
Comparison

     Actual  Predicted
465       0          0
554       1          1
433       0          0
75        0          0
140       0          1
117       0          0
841       0          0
132       0          1
91        0          0
614       0          0

In [43]:
nb.predict_proba(X_test[:10])

array([[0.97309809, 0.02690191],
       [0.29962535, 0.70037465],
       [0.96087536, 0.03912464],
       [0.96862811, 0.03137189],
       [0.33889956, 0.66110044],
       [0.93778217, 0.06221783],
       [0.9154479 , 0.0845521 ],
       [0.34729868, 0.65270132],
       [0.96447111, 0.03552889],
       [0.97285867, 0.02714133]])